src/Enums/ВидыОбменовСДЭК/ВидыОбменовСДЭК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбменовСДЭК</name>
  <enumValues>
    <name>СозданиеЗаказаНаДоставку</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияПоЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ПолучитьКвитанцию</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьПоТарифу</name>
  </enumValues>
  <enumValues>
    <name>УдалениеЗаказа</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ОтправлениеТранзита/ОтправлениеТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтправлениеТранзита</name>
  <registerRecords>AccumulationRegister.ЗаказыВПосылках</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтправитель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПВЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИстинныйПродавец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cityCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СМСОповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>CatalogRef.ТарифыТК</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетКалькулятора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородОтправитель</name>
    <type>
      <types>CatalogRef.ГородаBoxBerry</types>
      <types>CatalogRef.ГородаСДЭК</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифТК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифПВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифПВнп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПредоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПриема</name>
    <type>
      <types>CatalogRef.ПунктыВыдачиBoxBerry</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРПО</name>
    <type>
      <types>EnumRef.КатегорияРПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРПО</name>
    <type>
      <types>EnumRef.ВидРПО</types>
    </type>
  </attributes>
  <attributes>
    <name>Хрупкое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъявленнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомерЗаказаТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаГруза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УслугаDPD</name>
    <type>
      <types>CatalogRef.УслугиDPD</types>
    </type>
  </attributes>
  <attributes>
    <name>ТяжелыйГруз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Негаборит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Точка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаПриПолучении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеУдаления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтправленныеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолученныеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОбмена</name>
      <type>
        <types>EnumRef.ВидыОбменовСДЭК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетКалькулятораПочта</name>
    <attributes>
      <name>ВидОтправления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредельныйВес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НетРасчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/Интеграция_ТранспортныеКомпании_Общий/Module.bsl
Процедура  РасчитатьСтоимостьОтправления(ДокументОтправления) Экспорт
	если Ложь Тогда
		ДокументОтправления = Документы.ОтправлениеТранзита.СоздатьДокумент();
	КонецЕсли;	
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДатаДокумента",			ДокументОтправления.Дата);  		
	Параметры.Вставить("ОбъявленнаяСтоимость",	ДокументОтправления.ОбъявленнаяСтоимость);  		
	Параметры.Вставить("Хрупкое",				ДокументОтправления.Хрупкое);
	Параметры.Вставить("ИндексОтправителя", 	ДокументОтправления.ИндексОтправителя);  	
	Параметры.Вставить("ИндексПолучателя", 		ДокументОтправления.Индекс);  	
	
	Параметры.Вставить("Тип", 					ДокументОтправления.тип);
	Параметры.Вставить("Вес", 					ДокументОтправления.вес);
	Параметры.Вставить("Высота", 				ДокументОтправления.Высота);
	Параметры.Вставить("Ширина", 				ДокументОтправления.ширина);
	Параметры.Вставить("Длина", 				ДокументОтправления.Длина);
	
	Если Параметры.Тип = "postMail" или Параметры.Тип = "ems" Тогда
		Параметры.Вставить("ЭтоEMS", 		   (ДокументОтправления.ТочкаНазначения = СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду("0021")));
		Параметры.Вставить("КатегорияРПО", 		ДокументОтправления.КатегорияРПО);  	
		Параметры.Вставить("ВидРПО", 			ДокументОтправления.ВидРПО);  	
		Параметры.Вставить("Негаборит",			ДокументОтправления.Негаборит);  
		МодульИнтеграции = Интеграция_ПочтаРоссии;
	ИначеЕсли Параметры.Тип = "boxberry" или Параметры.Тип = "boxberryCourier" Тогда
		Параметры.Вставить("КодПС",				ДокументОтправления.ПунктПриема.Код);			//ПунктСдачи	
		Параметры.Вставить("КодПВЗ",			ДокументОтправления.КодПВЗ);					//ПунктПолучения
		
		МодульИнтеграции = Интеграция_BoxBerry;
	ИначеЕсли Параметры.Тип = "sdec" или Параметры.Тип = "sdecCourier" Тогда
		Параметры.Вставить("Логин",					ДокументОтправления.ТочкаНазначения.АккаунтДляОбменаСТК);
		Параметры.Вставить("Пароль",				ДокументОтправления.ТочкаНазначения.ПарольДляОбменаСТК);
		Параметры.Вставить("Тариф",					ДокументОтправления.Тариф.КодТарифа);
		Параметры.Вставить("КодГородаОтправителя",	ДокументОтправления.ГородОтправитель.Код);
		Параметры.Вставить("КодГородаПолучателя", 	ДокументОтправления.cityCode);
		Параметры.Вставить("ТяжелыйГруз", 			ДокументОтправления.ТяжелыйГруз);

		МодульИнтеграции = ОбменДаннымиСДЭК;
	ИначеЕсли Параметры.Тип = "dpd" Тогда
		Параметры.Вставить("Город",				ДокументОтправления.Город);
		Параметры.Вставить("КодПВЗ",			ДокументОтправления.КодПВЗ);					//ПунктПолучения
		Параметры.Вставить("УслугаDPD",			ДокументОтправления.УслугаDPD);
		МодульИнтеграции = Интеграция_DPD;
	ИначеЕсли Параметры.Тип = "" Тогда
		
	Конецесли;		
	
	Протокол			=  МодульИнтеграции.РассчитатьСтоимость(Параметры);
	строка_Протокола 	= ДокументОтправления.ПротоколыПередач.Добавить();
	ЗаполнитьЗначенияСвойств(строка_Протокола, Протокол);
	Если Протокол.Результат = "error" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Протокол.ТекстОшибки);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ДокументОтправления, Протокол,"ТарифТК, РасчетКалькулятора");
КонецПроцедуры

Процедура СформироватьЗаказ(ДокументОтправления) Экспорт
	если Ложь Тогда ДокументОтправления = Документы.ОтправлениеТранзита.СоздатьДокумент(); КонецЕсли;
	Параметры = новый Структура;
	Параметры.Вставить("Тип", 					ДокументОтправления.тип);
	Параметры.Вставить("Вес",					ДокументОтправления.Вес);
	Параметры.Вставить("Длина",					ДокументОтправления.Длина);
	Параметры.Вставить("Ширина",				ДокументОтправления.Ширина);
	Параметры.Вставить("Высота",				ДокументОтправления.Высота);
	Параметры.Вставить("Хрупкое",				ДокументОтправления.Хрупкое);
	Параметры.Вставить("ОбъявленнаяСтоимость",	ДокументОтправления.ОбъявленнаяСтоимость);
	Параметры.Вставить("МетодОплаты",			ДокументОтправления.Коробка.МетодОплаты);
	Параметры.Вставить("ФИО",					ДокументОтправления.ФИО);
	Параметры.Вставить("КодПВЗ",				ДокументОтправления.КодПВЗ);                        //ПунктПолучения
	Параметры.Вставить("Телефон",				ДокументОтправления.Телефон);
	Параметры.Вставить("email",					ДокументОтправления.email);
	Параметры.Вставить("Город",					ДокументОтправления.Город);
	Параметры.Вставить("Индекс",				ДокументОтправления.Индекс);
	Параметры.Вставить("НомерЗаказа",			ДокументОтправления.Номер);							//Наш номер


	
	
	Если Параметры.Тип = "dpd" Тогда
		Параметры.Вставить("ДатаПриемаГруза",	ДокументОтправления.ДатаПриемаГруза);
		Параметры.Вставить("УслугаDPD",			ДокументОтправления.УслугаDPD);
		
		МодульИнтеграции = Интеграция_DPD;
	ИначеЕсли Параметры.Тип="boxberry" или Параметры.Тип="boxberryCourier" Тогда	
		Параметры.Вставить("ИтогоСтоимость",	ДокументОтправления.ИтогоСтоимость);			
		Параметры.Вставить("ТарифТК",			ДокументОтправления.ТарифТК);			
		Параметры.Вставить("КодПС",				ДокументОтправления.ПунктПриема.Код);			//ПунктСдачи	
		Параметры.Вставить("СоставЗаказа",		ДокументОтправления.Заказы.Выгрузить(,"НомерСтроки, Покупка, Количество"));
		Параметры.Вставить("Адрес",				ДокументОтправления.Адрес);			
		
		МодульИнтеграции = Интеграция_BoxBerry;
	ИначеЕсли Параметры.Тип="sdec"  или Параметры.Тип = "sdecCourier"  Тогда	
		Параметры.Вставить("ИтогоСтоимость",	ДокументОтправления.ИтогоСтоимость);			
		Параметры.Вставить("ТарифТК",			ДокументОтправления.ТарифТК);			
		Параметры.Вставить("КодПС",				ДокументОтправления.ПунктПриема.Код);			//ПунктСдачи	
		Параметры.Вставить("СоставЗаказа",		ДокументОтправления.Заказы.Выгрузить(,"НомерСтроки, Покупка, Количество"));
		
		МодульИнтеграции = ОбменДаннымиСДЭК;
		
	ИначеЕсли Параметры.Тип = "" Тогда
		
	Конецесли;	
	Протокол =  МодульИнтеграции.СозданиеЗаказаНаДоставку(Параметры);
	
	строка_Протокола = ДокументОтправления.ПротоколыПередач.Добавить();
	ЗаполнитьЗначенияСвойств(строка_Протокола, Протокол);
	Если Протокол.Результат = "error" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Протокол.ТекстОшибки);
	КонецЕсли;
	ДокументОтправления.НомерЗаказа	=	Протокол.ТрекНомер;
КонецПроцедуры	

Функция  ПолучитьНаклейки(СписокДокументовОтправления) экспорт
	Если ТипЗнч(СписокДокументовОтправления) = Тип("ДокументСсылка.ОтправлениеТранзита") или 
		 ТипЗнч(СписокДокументовОтправления) = Тип("ДокументОбъект.ОтправлениеТранзита")Тогда
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов.Добавить(СписокДокументовОтправления);
	Иначе 	
		СписокДокументов = СписокДокументовОтправления;
	КонецЕсли;	
	
	тип = СписокДокументов[0].Значение.Тип;
	Если Тип = "dpd" тогда
		Возврат Интеграция_DPD.ПолучитьНаклейкиЗаказа(СписокДокументов);
	конецЕсли;
КонецФункции

Процедура УдалитьЗаказ(ДокументОтправления) Экспорт
	Параметры = новый Структура;
	Параметры.Вставить("Тип", 					ДокументОтправления.тип);

	Параметры.Вставить("НомерЗаказа",			ДокументОтправления.Номер);							//Наш номер
	Параметры.Вставить("НомерДПД",				ДокументОтправления.НомерЗаказа);							//Наш номер
	Если Параметры.Тип = "dpd" Тогда
		МодульИнтеграции = Интеграция_DPD;
	КонецЕсли;	
	Протокол =  МодульИнтеграции.УдалениеЗаказа(Параметры);
	строка_Протокола = ДокументОтправления.ПротоколыПередач.Добавить();
	ЗаполнитьЗначенияСвойств(строка_Протокола, Протокол);
	Если Протокол.Результат = "error" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Протокол.ТекстОшибки);
	Иначе	
		ДокументОтправления.НомерЗаказа	=	"";	
	КонецЕсли;
	
КонецПроцедуры



Функция ПолучитьСтруктуруПротокола(ВидОбмена = "Стоимость") Экспорт
	Если ВидОбмена = "Стоимость" Тогда
		ВидОбмена = Перечисления.ВидыОбменовСДЭК.СтоимостьПоТарифу ;
	КонецЕсли;	
	протокол = новый Структура;
	протокол.Вставить("ДатаНачала",				ТекущаяДата());
	протокол.Вставить("ОтправленныеДанные",		"");
	протокол.Вставить("ПолученныеДанные",		"");
	протокол.Вставить("ВидОбмена",				ВидОбмена);
	протокол.Вставить("ТекстОшибки", 			"");
	
	протокол.Вставить("ДатаОкончания");
	протокол.Вставить("Результат");
	Если ВидОбмена = Перечисления.ВидыОбменовСДЭК.СтоимостьПоТарифу Тогда
		протокол.Вставить("ТарифТК",			0);
		протокол.Вставить("РасчетКалькулятора",	"");
	ИначеЕсли ВидОбмена = Перечисления.ВидыОбменовСДЭК.СозданиеЗаказаНаДоставку Тогда	
		протокол.Вставить("ТрекНомер",			"");
	ИначеЕсли ВидОбмена = Перечисления.ВидыОбменовСДЭК.ПолучитьКвитанцию Тогда		
		протокол.Вставить("Файл",			"");
		Протокол.Вставить("ТипФайла",		"");
	КонецЕсли;
	Возврат протокол;
КонецФункции	

//
//Получаем представление Отправленных данных, когда взаимодействуем через Web servis
//
Функция ПолучитьОтправляемыеДанные(Параметры) экспорт
	Текст = "";
	Если ТипЗнч(Параметры) = тип("СписокЗначений") Тогда
		Для каждого элем из Параметры цикл
			Текст = Текст +"Документ: "+Элем.Значение.Номер+" от "+Элем.Значение.Номер+", трек:"+Элем.Значение.НомерЗаказа+", гуппа:"+Элем.Значение.Коробка+"."+Символы.ПС;
		КонецЦикла;	
	Конецесли;	
	Если ТипЗнч(Параметры) = тип("Структура") Тогда
		Для каждого элем из Параметры цикл
			Текст = Текст + элем.Ключ+ ": "+Элем.Значение+", "+Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	Возврат Текст;
КонецФункции
